# ServiceName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ServiceName Property
FabricationPart Class See Also
---
The name of the service associated with the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ServiceName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceName As String
	Get
```

Visual C++
---
```text
public:
property String^ ServiceName {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace